{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "bias": true, "nb_filter": 16, "init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "tf", "batch_input_shape": [null, 30, 30, 3], "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "W_constraint": null, "activation": "relu", "nb_col": 3, "activity_regularizer": null, "trainable": true, "bias": true, "nb_filter": 8, "init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "output_dim": 7, "b_constraint": null, "activation": "relu", "W_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "activation": "sigmoid", "W_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_2"}}]}