{"config": [{"config": {"batch_input_shape": [null, 30, 30, 3], "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "bias": true, "activation": "relu", "trainable": true, "input_dtype": "float32", "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "b_constraint": null, "nb_filter": 32, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "b_constraint": null, "nb_filter": 16, "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 60, "b_regularizer": null, "activation": "relu", "bias": true, "W_constraint": null, "W_regularizer": null, "name": "dense_1", "input_dim": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "output_dim": 1, "b_regularizer": null, "activation": "sigmoid", "bias": true, "W_constraint": null, "W_regularizer": null, "name": "dense_2", "input_dim": null, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}